<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="oak_input" type="Parameter" version="opset1">
			<data shape="1,3,10,165" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="oak_input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>10</dim>
					<dim>165</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="const_fold_opt__100" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__100">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="TCN_OAK_WRAPPED_1/reshape_to_sequence_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>10</dim>
					<dim>165</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/reshape_to_sequence_1/Reshape:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>99</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_32" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="24" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_33" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="48" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_31_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="72" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="6" name="Constant_31" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="7" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>99</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/Pad:0">
					<dim>1</dim>
					<dim>52</dim>
					<dim>99</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="const_fold_opt__109" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="74" size="8" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__109">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>52</dim>
					<dim>99</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>52</dim>
					<dim>99</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_36" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution__17" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>52</dim>
					<dim>99</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution__17:0">
					<dim>1</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 99, 1, 3" offset="114" size="38016" />
			<output>
				<port id="0" precision="FP16" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/ExpandDims_1:0">
					<dim>64</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="axes_const__37__88" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38130" size="8" />
			<output>
				<port id="0" precision="I64" names="axes_const__37__88">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_41" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="38138" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution__18" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1/convolution__18:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_2228_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38162" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_2228" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Range_49" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38130" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/mean:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/SquaredDifference" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/SquaredDifference:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/SquaredDifference__20" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/SquaredDifference__20:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Range_62" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38130" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/moments/variance:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_2227_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38164" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_2227" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/add:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Rsqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Rsqrt:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Rsqrt__21" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Rsqrt__21:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Reshape:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="38166" size="128" />
			<output>
				<port id="0" precision="FP16" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Reshape:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Reshape:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/mul:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/mul_2:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_2229_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38294" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_2229" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Neg" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/Neg:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/mul_1:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1/add_2:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="TCN_OAK_WRAPPED_1/temporal_block_1/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/activation_1/Relu:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_76" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="24" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_77" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="48" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_75_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="72" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="45" name="Constant_75" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="46" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/Pad:0">
					<dim>1</dim>
					<dim>52</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>52</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>52</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_80" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution__26" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>52</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution__26:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 1, 3" offset="38296" size="49152" />
			<output>
				<port id="0" precision="FP16" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_85" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="38138" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution__27" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_1_2/convolution__27:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_2231_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38162" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_2231" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Range_93" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38130" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/mean:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/SquaredDifference" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/SquaredDifference:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/SquaredDifference__29" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/SquaredDifference__29:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Range_106" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38130" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/moments/variance:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_2230_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38164" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_2230" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/add:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/Rsqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/Rsqrt:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/Rsqrt__30" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/Rsqrt__30:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="TCN_OAK_WRAPPED_1/temporal_block_2_1/layer_normalization_5_1/Reshape:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 128" offset="87448" size="256" />
			<output>
				<port id="0" precision="FP16" names="TCN_OAK_WRAPPED_1/temporal_block_2_1/layer_normalization_5_1/Reshape:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="TCN_OAK_WRAPPED_1/temporal_block_2_1/layer_normalization_5_1/Reshape:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/mul:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/mul_2:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_2232_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38294" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_2232" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/Neg" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/Neg:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/mul_1:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/layer_normalization_1_2/add_2:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="TCN_OAK_WRAPPED_1/temporal_block_1/activation_1_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/activation_1_2/Relu:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>99</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>50</dim>
					<dim>99</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution__10" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>50</dim>
					<dim>99</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution__10:0">
					<dim>1</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 99, 1, 1" offset="87704" size="25344" />
			<output>
				<port id="0" precision="FP16" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/ExpandDims_1:0">
					<dim>128</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>99</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_29" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="38138" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution__11" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/conv1d_2_1/convolution__11:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="TCN_OAK_WRAPPED_1/temporal_block_1/add_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1/add_1/Add:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_121" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="113048" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_122" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="48" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_120_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="72" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="92" name="Constant_120" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="93" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/Pad:0">
					<dim>1</dim>
					<dim>54</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>54</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>54</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_125" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution__35" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>54</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution__35:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/ExpandDims_1:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128, 1, 3" offset="113072" size="49152" />
			<output>
				<port id="0" precision="FP16" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/ExpandDims_1:0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/ExpandDims_1:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 2" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution/Squeeze:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_130" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="38138" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution__36" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/conv1d_3_1/convolution__36:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_2234_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="38162" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_2234" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Range_138" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38130" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/layer_normalization_2_1/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/layer_normalization_2_1/moments/mean:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/layer_normalization_2_1/moments/SquaredDifference" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/layer_normalization_2_1/moments/SquaredDifference:0">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="TCN_OAK_WRAPPED_1/temporal_block_1_2/layer_normalization_2_1/moments/SquaredDifference__38" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TCN_OAK_WRAPPED_1/temporal_block_1_2/layer_normalization_2_1/moments/SquaredDifference__38:0">
